TYPES = {
    "RegionType": {
        "обл", "обл.", "область"
    },
    "LocalityType": {
        "м", "м.", "місто", "г", "г.", "город", "пос", "пос.", "смт", "смт.", "с.м.т", "пгт", "п г т", "пгт.",
        "село", "селище", "поселок", "с-ще"
    },
    "CountyType": {
        "р-н", "р-н.", "рн", "рн.", "р-он", "район"
    },
    "SubLocalityType": {
        "мікр", "мікр.", "мн", "мр", "мкрн", "мкр", "мікрорайон",
        "микр", "микр.", "микрорайон", "м-н", "м-р"
    },
    "StreetType": {
        "вул", "вул.", "вулиця", "ул", "ул.", "улица", "влу.", "в.", "вулю", "улиця",
        "пров", "пров.", "провулок", "пер", "пер.", "переулок", "прос", "провул", "провул.", "прв.", "перевуло", "про",
        "бул", "бул.", "б-р", "бр", "бр.", "бур", "бур.", "бульвар", "бульв", "бульв.", "бул-р.", "буль.", "б_р", "бкл.",
        "просп", "просп.", "прт", "прт.", "прокт", "прокт.", "пр", "пр.", "п-т", "п-т.", "п-рт.", "проспект", "пр-кт", "пр-к", "прпосп", "пр_т", "прʼт", "пр-т", "проп",
        "ж\м", "ж/м", "масив", "массив", "житловий масив", "жилой массив", "ж.м.",
        "ш.", "шосе", "шоссе",
        "алея", "аллея",
        "майд", "майд.", "майдан",
        "розвилка", "развилка",
        "узвіз", "спуск", "узв",
        "проїзд", "проезд", "пр-д",
        "дорога",
        "наб", "наб.", "набер.", "набережна", "набережная",
        "парк",
        "сквер",
        "тупик",
        "прохід", "проход",
        "ст", "ст.", "станція", "станция",
        "остр", "остр.", "острів", "остров",
        "шлях", "путь",
        "гай", "роща",
        "пл", "пл.", "площа", "площадь",
        "в'їзд", "въезд",
        "лінія", "линия",
        "траса", "трасса",
        "урочище",
        "шахта",
        "хутір", "хутор",
        "роз'їзд", "разъезд",
        "квартал", "кв-л",
        "присілок",
        "плесо",
        "завулок", "проулок", "зав."
    },
    "HousingType": {
        "корп", "корп.", "корпус"
    },
    "HostelType": {
        "гурт", "гурт.", "гуртожиток", "общ", "общ.", "общежитие"
    },
    "HouseNumberType": {
        "буд.", "будинок", "дом", "д.", "б.", "зд", "зд."
    },
    "ApartmentType": {
        "кв.", "квартира"
    },
    "RoomType": {
        "прим."
    },
    "SectorType": {
        "секція", "секц"
    },
    "EntranceType": {
        "підʼїзд", "подъезд"
    },
    "FloorType": {
        "поверх", "этаж"
    }
}